<?php

return [
    /*
    |--------------------------------------------------------------------------
    | Super administrator account.
    | 超级管理员账号
    |--------------------------------------------------------------------------
    |
    | Account with super permissions.
    |
    */
    'admin_email' => [
        'admin@admin.com',
    ],

    /*
    |--------------------------------------------------------------------------
    | Jump not logged in 'route'.
    | 未登录跳转路由名称
    |--------------------------------------------------------------------------
    */
    'not_login_redirect' => 'admin.login',

    /*
    |--------------------------------------------------------------------------
    | Login successful jump to 'route.
    | 登陆成功跳转默认路由名称
    |--------------------------------------------------------------------------
    */
    'login_successful_redirect' => 'admin.welcome',

    /*
    |--------------------------------------------------------------------------
    | Allowed route.
    | 允许放行路由
    |--------------------------------------------------------------------------
    |
    | Routes that do not require permission detection.
    | 不需要检测权限的路由
    |
    | example:
    |
    | 'allow' => [
    |   ['method' => 'get', 'uri' => '/admin/welcome'],
    |   ['method' => 'post', 'uri' => '/admin/welcome'],
    |   ['method' => 'any', 'uri' => '/admin/welcome'],
    | ],
    */
    'allow' => [
        ['method' => 'get', 'uri' => '/admin/welcome'],
    ],

    /*
    |--------------------------------------------------------------------------
    | Custom blade
    | 自定义模板
    |--------------------------------------------------------------------------
    |
    | Extends parent class template.
    |
    | Blade example:
    | <head>
    |   <title>@yield('title') {{ config('app.name', '') }}</title>
    |   @yield('style')
    | </head>
    |
    | <body>
    |
    |   ...
    |   ...
    |
    | @yield('script')
    | </body>
    |
    */
    'extends_blade' => 'admin::layouts.app',

    /*
    |--------------------------------------------------------------------------
    | 403 view.
    | 403 没有权限页面模板
    |--------------------------------------------------------------------------
    */
    '403_view' => 'admin::widget.403',
];
